In [1]:
import pandas as pd ; import numpy as np

In [2]:
s = pd.Series(["ali",np.nan,"efe","mete"])
s

0     ali
1     NaN
2     efe
3    mete
dtype: object

In [3]:
#eksik veri olup olmadığını kontrol etmek için 
s.isnull()
#NaN değer ise True değilse False

0    False
1     True
2    False
3    False
dtype: bool

In [5]:
#isnull ile aynı ama burda boş olmayan değerler True olanlar False
s.notnull()

0     True
1    False
2     True
3     True
dtype: bool

In [7]:
#aşağıdaki iki yöntemle de eksik verilerin olduğu satırlar kaldırılabilir ama kalıcı değildir
s.dropna()
s[s.notnull()]

0     ali
2     efe
3    mete
dtype: object

In [9]:
#dataFrame deki eksik verileri nasıl kaldıracağımızı görelim
from numpy import nan as NA

In [11]:
df = pd.DataFrame([[1,2,3],[4,NA,5],[NA,NA,NA]])
df

     0    1    2
0  1.0  2.0  3.0
1  4.0  NaN  5.0
2  NaN  NaN  NaN

In [12]:
#bu fonskiyonu bu şekilde kullanırsak içinde bir adet bile NaN değer bulunduran satır varsa siler 
df.dropna()

     0    1    2
0  1.0  2.0  3.0

In [13]:
#bu şekilde parametre verirsek tüm değerleri NaN olan satırları siler 
df.dropna(how="all")

     0    1    2
0  1.0  2.0  3.0
1  4.0  NaN  5.0

In [15]:
#df dataframe'inin 1. sütununa nan değeri atadık
df[1] = NA
df

     0   1    2
0  1.0 NaN  3.0
1  4.0 NaN  5.0
2  NaN NaN  NaN

In [22]:
#tüm değerleri nana olan sütunu silmek için axis = 1 parametresi kullanılır 
df.dropna(how="all",axis=1)

     0    2
0  1.0  3.0
1  4.0  5.0
2  NaN  NaN

In [24]:
#belirli sayıda değeri olan satırları yazdırmak için
df.dropna(thresh=1)
#içinde en az 1 adet tam veri olan satırları yazdır

     0   1    2
0  1.0 NaN  3.0
1  4.0 NaN  5.0

In [25]:
#eksik veri yerine değer atamak istersek
df

     0   1    2
0  1.0 NaN  3.0
1  4.0 NaN  5.0
2  NaN NaN  NaN

In [26]:
df.fillna("eksik")

       0      1      2
0    1.0  eksik    3.0
1    4.0  eksik    5.0
2  eksik  eksik  eksik

In [27]:
#eksik verilere sütun bazında değerler atayabiliriz
eksik_veri = {0:15,1:25,2:35}
df.fillna(eksik_veri)

      0     1     2
0   1.0  25.0   3.0
1   4.0  25.0   5.0
2  15.0  25.0  35.0

In [28]:
#yukarıdak işlem veri setimizi modifiye etmeyecek yani tekrar df yazdırırsak eksik veriler görünecek
df

     0   1    2
0  1.0 NaN  3.0
1  4.0 NaN  5.0
2  NaN NaN  NaN

In [29]:
#yaptığımız değişikliğin kalıcı olması için
df.fillna(eksik_veri,inplace=True)

In [32]:
#görüldüğü gibi tekrar yazdırdığımız zanan yukarıda yaptığımız işlem kalıcı hale gelmiş oldu 
df

      0     1     2
0   1.0  25.0   3.0
1   4.0  25.0   5.0
2  15.0  25.0  35.0

In [33]:
#df veri setimizi tekrar yazduralım
df = pd.DataFrame([[1,2,3],[4,NA,5],[NA,NA,NA]])
df

     0    1    2
0  1.0  2.0  3.0
1  4.0  NaN  5.0
2  NaN  NaN  NaN

In [37]:
#aşağıdaki parametre ile veri setinde boş olan yerlere bir üst satırındaki değer atanır
df.ffill()

     0    1    2
0  1.0  2.0  3.0
1  4.0  2.0  5.0
2  4.0  2.0  5.0

In [38]:
#bu fonksiyon da bir sonraki değeri ile doldurur ama tablodaki nan değerlerinden sonra başka değer olmadığı için bu örnekte değerler yine boş
#kalacak
df.bfill()

     0    1    2
0  1.0  2.0  3.0
1  4.0  NaN  5.0
2  NaN  NaN  NaN

In [39]:
#eksik verilerin yerine veri setindeki değerlerin ortalamasını eklemek için
veri = pd.Series([1,0,NA,5])
veri

0    1.0
1    0.0
2    NaN
3    5.0
dtype: float64

In [40]:
veri.fillna(veri.mean())

0    1.0
1    0.0
2    2.0
3    5.0
dtype: float64

In [41]:
#dataframe içinde her bir eksik veri yerine sütunun ortalaması atanmış olacak
df.fillna(df.mean())

     0    1    2
0  1.0  2.0  3.0
1  4.0  2.0  5.0
2  2.5  2.0  4.0